** Services

Each function admits an argument named =service= to choose the
service. After loading =meteoForecast= the default service is
Meteogalicia as reported with:

#+begin_src R
mfService()
#+end_src

#+RESULTS:
: [1] "meteogalicia"

You can choose a different service (for the running session) using
  =mfService= with the name of the service.
#+begin_src R
mfService('gfs')
#+end_src

#+RESULTS:
: Option service changed to gfs

#+begin_src R
mfService('meteogalicia')
#+end_src

#+RESULTS:
: Option service changed to meteogalicia

** Basic information about services

- =mfProj4= provides the projection of a service:
#+begin_src R
mfProj4('nam')
#+end_src

#+RESULTS:
: [1] "+proj=lcc +lat_1=25 +lat_0=25 +lon_0=-95 +k_0=1 +x_0=0 +y_0=0 +a=6367470.21484375 +b=6367470.21484375 +units=km +no_defs "

- =mfExtent= provides the extent of a service (using the class
  =Extent= defined by the package =raster=):
#+begin_src R
mfExtent('meteogalicia', resolution = 36)
#+end_src

#+RESULTS:
: class       : Extent 
: xmin        : -49.18259 
: xmax        : 18.789 
: ymin        : 24.03791 
: ymax        : 56.06608


